<style lang="scss">
#role-trending-intro {
  .content {
    h2 {
      margin-bottom: 15px;
      margin-top: 15px;
      font-size: 16px;
    }

    p {
      line-height: 20px;
      margin-top: 10px;
      margin-bottom: 10px;
      font-size: 14px;
    }

    ul {
      margin-left: 2em;
      margin-top: 10px;
      margin-bottom: 10px;
    }

    li {
      list-style-type: disc;
      line-height: 24px;
      font-size: 14px;
    }
  }
}
</style>

<template>
  <div id="role-trending-intro">
    <div class="container content">
      <h2>前言</h2>
      <p>「股市」是 calibur 一个新的偶像应援系统，它将取代之前的「偶像排行榜」</p>
      <p>「偶像排行榜」最大的问题是：偶像的团子数只会增加，不会减少，这样会越积累越多，榜单的排名也很难在变动</p>
      <p>「股市」有"入股"和"出售"两个概念，虽然偶像的团子会越来越多，但是单个团子的价格是变动的，会"升值"也会"贬值"，这就能让榜单流动起来，有利于新偶像的竞争</p>
      <p>对于参与了"初代守护者争夺战"的漫友，非常感谢你们的参与，我们会为你提供以下补偿：</p>
      <ul>
        <li>绝大多数参与者都会赠予徽章，"守护者"获得的徽章都将是独一无二的</li>
        <li>之后我们会专门开设一个页面，展示和纪念这次活动，你们的名字将永远被人铭记</li>
      </ul>
      <h2>如何注册公司</h2>
      <p>
        前往电脑端网页，填写表单即可注册公司
      </p>
      <p>注册公司的一些要求：</p>
      <ul>
        <li>请勿成立重复的公司，注册公司前请先善用搜索功能，查看该公司是否已存在，重复的公司将被删除</li>
        <li>为了筛选垃圾信息，注册公司需要提供10个虚拟币作为"注册资本"，公司被删除时，注册资本不反还</li>
        <li>偶像的「头像」建议使用其具有代表性的图片，并且不要混入其它人在内，否则视为违规</li>
        <li>偶像的「名称」选择其具有代表性的名称即可，比如《黑之契约者》的男主角："李舜生"、"黑色死神"、"BK-201"、"黑"这四个名字，建议使用"BK-201"，不会与其它角色重复，将其它几个名称代号填写到「别名」里就可以了</li>
        <li>偶像的「简介」目前仅支持纯文本，请勿输入无关内容</li>
        <li>「番剧」一栏，输入你要把偶像关联到的正确番剧，填写不对应的番剧将会被视为垃圾数据而删除，若番剧搜索不到，请加QQ群「106402736」进行反馈</li>
        <li>公司成立后，番剧的管理员可以修改除「名称」以为的数据</li>
        <li>其它一些需要管理员帮忙调整信息的，也请加入QQ群反馈</li>
      </ul>
      <h2>如何炒股</h2>
      <p>公司注册成功之后，只要满20个人入股，公司就会"上市"</p>
      <p>上市之后，会选择持股数最多的人成为"大股东"，"大股东"即为以前的"守护者"</p>
      <p>大股东可以在"偶像详情页"的"变更"一栏修改公司的股价和股票发行总量</p>
      <p>大股东还可以在页面留下自己想说的话，第一个大股东可以创建一个应援QQ群</p>
      <p>增发提案发起后，超过 2/3 的票数同意后才能修改股价和发行量</p>
      <p>关于「每股股价」和「发行量」：</p>
      <ul>
        <li>默认开办的公司，股价为：<strong>￥1.00虚拟币/股</strong>，<strong>无入股上限</strong>，此时有20个人，共入股了200个虚拟币，那么上市的时候，公司的市值是：<strong>￥1.00</strong>（每股的股价）× 200（总股数）= <strong>￥200.00</strong></li>
        <li>
          公司上市之后，大股东可设置股价，以及发行量，假设此时设置股价为<strong>￥2.00虚拟币/股</strong>，发行量为<strong>1000股</strong>，那么可再入股的股数就是：<strong>1000 - 200 = 800</strong>
        </li>
        <li>
          若800股全部出售，此时公司的市值是：<strong>￥200.00</strong>（历史市值）+ <strong>￥2.00</strong>（每股股价）× <strong>800</strong>（发行额）= <strong>￥1800.00</strong>
        </li>
        <li>当然定价 <strong>￥2.00虚拟币/股</strong> 也可能没有人会买，所以市值并不是在发行的时候就变了，而是产生"交易"后才会变动</li>
      </ul>
      <p>关于「停牌」和「挂牌」：</p>
      <ul>
        <li>大股东设置了股票发行量之后，若所有的股票都被购买了，那么就会"停牌"，所有人无法入股</li>
        <li>只要大股东再次增发股票，设置价格之后，就会继续"挂牌"交易，可以继续买入新的股票</li>
        <li><strong>股票的发行量以及股价每周可修改一次</strong>，请各位大股东定价的时候要三思，若定价不合理导致投资人抛售手上的股份，那么公司的市值就会下降</li>
      </ul>
      <p>关于「交易所」：</p>
      <p>
        投资人入股之后，若偶像成功上市（满20个投资人），即可在
        <nuxt-link to="/role/trending/hall">
          <el-button
            round
            size="mini"
          >交易所</el-button>
        </nuxt-link>
        出售自己的股份（在偶像详情页面，点击「出售」按钮即可发布交易）
      </p>
      <p>有关交易的介绍：</p>
      <ul>
        <li>每个投资人，对每个偶像每次只能发起一笔交易，发起之后，最短每10分钟可修改一次出售的<strong>总量</strong>和<strong>每股价格</strong></li>
        <li>对于上面的<strong>￥2.00虚拟币/股</strong>的公司，你可以在"停牌"时高于这个价格出售，在"挂牌"时低于这个价格出售</li>
        <li>高于市场价出售你就赚了，低于市场价"抛售"，你可能会赚也可能会亏（原始股￥1.00虚拟币/股，基本都是低于市场价买入的）</li>
        <li><strong>但无论你是赚了还是亏了，都会导致公司的市值发生变动</strong></li>
      </ul>
      <h2>最后</h2>
      <p>有以下恶劣行为者，会遭到处罚：</p>
      <ul>
        <li>申请多个小号，操控股价者，会被封禁，再也无法参与股市的买卖</li>
        <li>注册重复公司的人，会被删除注册的公司，"注册资本"不反还</li>
      </ul>
      <p>遇到情况，请加入QQ群：<strong>106402736</strong>进行反馈</p>
      <p>在未来，我们会把「社区」和「股市」结合起来，会让股市有更多的玩法，希望大家会喜欢</p>
    </div>
  </div>
</template>

<script>
export default {
  name: 'RoleTrendingIntro',
  head: {
    title: '游戏规则'
  }
}
</script>
